## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.example will be created
  + resource "azurerm_key_vault" "example" {
      + access_policy                 = [
          + {
              + key_permissions = [
                  + "Get",
                  + "Create",
                  + "WrapKey",
                  + "UnwrapKey",
                  + "Sign",
                  + "Verify",
                ]
              + object_id       = "fdc5b1ff-7979-4461-97fd-7982bdce7a23"
              + tenant_id       = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
            },
        ]
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "example-keyvault"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + resource_group_name           = "test-RG"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # azurerm_key_vault_key.example will be created
  + resource "azurerm_key_vault_key" "example" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + expiration_date         = "2024-12-30T20:00:00Z"
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "verify",
        ]
      + key_size                = 2048
      + key_type                = "RSA-HSM"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "example-cmk"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # azurerm_network_security_group.NSG will be created
  + resource "azurerm_network_security_group" "NSG" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "NSG1"
      + resource_group_name = "test-RG"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.http will be created
  + resource "azurerm_network_security_rule" "http" {
      + access                      = "Deny"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "example"
      + network_security_group_name = "NSG1"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "test-RG"
      + source_address_prefix       = "Internet"
    }

  # azurerm_network_security_rule.https will be created
  + resource "azurerm_network_security_rule" "https" {
      + access                      = "Deny"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "example"
      + network_security_group_name = "NSG1"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "test-RG"
      + source_address_prefix       = "Internet"
    }

  # azurerm_network_security_rule.rdp will be created
  + resource "azurerm_network_security_rule" "rdp" {
      + access                      = "Deny"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "example2"
      + network_security_group_name = "NSG1"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "test-RG"
      + source_address_prefix       = "Internet"
    }

  # azurerm_network_security_rule.ssh will be created
  + resource "azurerm_network_security_rule" "ssh" {
      + access                      = "Deny"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "example3"
      + network_security_group_name = "NSG1"
      + priority                    = 120
      + protocol                    = "Tcp"
      + resource_group_name         = "test-RG"
      + source_address_prefix       = "Internet"
    }

  # azurerm_private_endpoint.testprvendpoint will be created
  + resource "azurerm_private_endpoint" "testprvendpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "testprvendpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "test-RG"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "example-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
        }
    }

  # azurerm_private_endpoint.testprvendpoint2 will be created
  + resource "azurerm_private_endpoint" "testprvendpoint2" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "testprvendpoint2"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "test-RG"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "example-privateserviceconnection2"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
        }
    }

  # azurerm_storage_account.testSA will be created
  + resource "azurerm_storage_account" "testSA" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "kmiszeltestsa12"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = false
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "test-RG"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = false
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 365
            }
        }

      + customer_managed_key {
          + key_vault_key_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + queue_properties {
          + logging {
              + delete                = true
              + read                  = true
              + retention_policy_days = 10
              + version               = "1.0"
              + write                 = true
            }
        }

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "2024-12-30T20:00:00Z"
        }
    }

  # azurerm_subnet.endpoint will be created
  + resource "azurerm_subnet" "endpoint" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "endpoint"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "test-RG"
      + virtual_network_name                           = "example-network"
    }

  # azurerm_subnet_network_security_group_association.example will be created
  + resource "azurerm_subnet_network_security_group_association" "example" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "example-network"
      + resource_group_name = "test-RG"
      + subnet              = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>